rm(list=ls())
library(fs)
library(vroom)
library(broom)# tidy()
library(stringr)
library(tidyverse)
library(formattable)

# 분석용 csv파일 불러오기
path_001 <- 'D:/github'
df_list_001 <- dir_ls(path = path_001, regexp = 'analyze_target.*\\.csv$')

df_001 <- vroom(df_list_001)

# '당뇨병의사진단여부'에 따른 분석집단 구분
# '당뇨병의사진단여부'에 따른 응답 빈도 비교
#df_001 %>% count(당뇨병의사진단여부)

# df_diabetes_001: 당뇨병의사진단여부="있음" 응답자
df_diabetes_001 <- 
  df_001 %>% filter(당뇨병의사진단여부=="있음") %>%
# '당뇨병의사진단여부' 열 제거
  select(-당뇨병의사진단여부)
#nrow(df_diabetes_001)

# df_non_diabetes_001: 당뇨병의사진단여부="없음" 응답자
df_non_diabetes_001 <- df_001 %>% filter(당뇨병의사진단여부=="없음") %>%
# '당뇨병의사진단여부' 열 제거
  select(-당뇨병의사진단여부)
#nrow(df_non_diabetes_001)

# 변수 및 요인별 빈도수 정리 함수 생성
summary_freq <- function(col_01){
  df_freq_01 <- df_diabetes_001 %>% count(.data[[col_01]]) %>% mutate(
                당뇨경험집단 = paste0(comma(n, digits = 0), '(', round(n/sum(n)*100, 2), '%)')
                 ) %>% select(-n)
  df_freq_02 <- df_non_diabetes_001 %>% count(.data[[col_01]]) %>% mutate(
                일반집단 = paste0(comma(n, digits = 0), '(', round(n/sum(n)*100, 2), '%)')
                 ) %>% select(-n)
  df_freq_03 <- df_freq_01 %>% left_join(df_freq_02, by=col_01) %>% 
                rename(요인 = all_of(col_01)) %>% mutate(변수명 = col_01) %>% 
                select(변수명, 요인, 당뇨경험집단, 일반집단)
  df_chidq_01 <- df_001 %>% select(all_of(col_01), 당뇨병의사진단여부) %>% table() %>%
                 # pearson 카이제곱 적용
                 chisq.test(correct = FALSE) 
  df_chidq02 <- df_chidq_01 %>% tidy() %>% select(`X-squared`='statistic', `p-value` = `p.value`) %>%
                 mutate(
                   `X-squared` = sprintf('%.2f', `X-squared`),
                   `p-value` = case_when(
                   `p-value` >= 0.05 ~ '> 0.05',
                   `p-value` >= 0.01 ~ '< 0.05',
                   TRUE ~ '< 0.01'
                   ))
  df_fit_01 <- bind_cols(df_freq_03, df_chidq02)
  
  return(df_fit_01)
}

# 각 변수별 교차분석 진행
result_01 <- data.frame(rbind(
  summary_freq('성별'),
  summary_freq('연령구분'),
  summary_freq('교육수준'),
  summary_freq('결혼여부'),
  summary_freq('거주지역'),
  summary_freq('경제활동상태'),
  summary_freq('중위가구소득'),
  summary_freq('흡연자'),
  summary_freq('고위험음주여부'),
  summary_freq('유산소실천여부'),
  summary_freq('스트레스인지'),
  summary_freq('범불안장애위험'),
  summary_freq('비만여부'),
  summary_freq('고혈압의사진단여부'),
  summary_freq('이상지질혈증의사진단여부')
), check.names = FALSE)

print(result_01)
#                     변수명     요인 당뇨경험집단      일반집단 X-squared p-value
#1                      성별     남자  455(56.45%) 4,146(41.55%)     67.68  < 0.01
#2                      성별     여자  351(43.55%) 5,832(58.45%)     67.68  < 0.01
#3                  연령구분   45이하   98(12.16%)    5,089(51%)    450.73  < 0.01
#4                  연령구분   46이상  708(87.84%)    4,889(49%)    450.73  < 0.01
#5                  교육수준 고졸이하  518(64.27%) 4,538(45.48%)    105.71  < 0.01
#6                  교육수준 대졸이상  288(35.73%) 5,440(54.52%)    105.71  < 0.01
#7                  결혼여부     기혼  733(90.94%) 7,101(71.17%)    146.77  < 0.01
#8                  결혼여부     미혼    73(9.06%) 2,877(28.83%)    146.77  < 0.01
#9                  거주지역       동  616(76.43%) 8,487(85.06%)     42.21  < 0.01
#10                 거주지역   읍·면  190(23.57%) 1,491(14.94%)     42.21  < 0.01
#11             경제활동상태   아니요  250(31.02%) 2,781(27.87%)      3.65  > 0.05
#12             경제활동상태       예  556(68.98%) 7,197(72.13%)      3.65  > 0.05
#13             중위가구소득     미만  448(55.58%) 4,920(49.31%)     11.74  < 0.01
#14             중위가구소득     이상  358(44.42%) 5,058(50.69%)     11.74  < 0.01
#15                   흡연자 비흡연자  583(72.33%) 8,079(80.97%)     35.19  < 0.01
#16                   흡연자   흡연자  223(27.67%) 1,899(19.03%)     35.19  < 0.01
#17           고위험음주여부 고위험군  123(15.26%)  1,347(13.5%)      1.96  > 0.05
#18           고위험음주여부   정상군  683(84.74%)  8,631(86.5%)      1.96  > 0.05
#19           유산소실천여부   비실천  487(60.42%) 4,775(47.86%)     47.14  < 0.01
#20           유산소실천여부     실천  319(39.58%) 5,203(52.14%)     47.14  < 0.01
#21             스트레스인지 많이인지  244(30.27%) 2,828(28.34%)      1.36  > 0.05
#22             스트레스인지 적게인지  562(69.73%) 7,150(71.66%)      1.36  > 0.05
#23           범불안장애위험     양호  681(84.49%)  8,531(85.5%)      0.61  > 0.05
#24           범불안장애위험     위험  125(15.51%)  1,447(14.5%)      0.61  > 0.05
#25                 비만여부     비만  452(56.08%) 3,448(34.56%)    149.65  < 0.01
#26                 비만여부   비만전  354(43.92%) 6,530(65.44%)    149.65  < 0.01
#27       고혈압의사진단여부     없음   378(46.9%) 8,685(87.04%)    896.05  < 0.01
#28       고혈압의사진단여부     있음   428(53.1%) 1,293(12.96%)    896.05  < 0.01
#29 이상지질혈증의사진단여부     없음  278(34.49%) 8,480(84.99%)   1246.30  < 0.01
#30 이상지질혈증의사진단여부     있음  528(65.51%) 1,498(15.01%)   1246.30  < 0.01