rm(list=ls())
library(fs)
library(vroom)
library(broom)# tidy()
library(stringr)
library(tidyverse)
library(formattable)

# 분석용 csv파일 불러오기
path_001 <- 'D:/github'
df_list_001 <- dir_ls(path = path_001, regexp = 'analyze_target.*\\.csv$')

df_001 <- vroom(df_list_001)

# '당뇨병의사진단여부'에 따른 분석집단 구분
# '당뇨병의사진단여부'에 따른 응답 빈도 비교
#df_001 %>% count(당뇨병의사진단여부)

# df_diabetes_001: 당뇨병의사진단여부="있음" 응답자
df_diabetes_001 <- 
  df_001 %>% filter(당뇨병의사진단여부=="있음") %>%
# '당뇨병의사진단여부' 열 제거
  select(-당뇨병의사진단여부)
#nrow(df_diabetes_001)

# df_non_diabetes_001: 당뇨병의사진단여부="없음" 응답자
df_non_diabetes_001 <- df_001 %>% filter(당뇨병의사진단여부=="없음") %>%
# '당뇨병의사진단여부' 열 제거
  select(-당뇨병의사진단여부)
#nrow(df_non_diabetes_001)

# 변수 및 요인별 빈도수 정리 함수 생성
summary_freq <- function(col_01, col_02, 
                         group_01, group_02,
                         df_01, df_02, df_03){
  df_freq_01 <- df_01 %>% count(.data[[col_01]]) %>% mutate(
                !!group_01 := paste0(comma(n, digits = 0), '(', round(n/sum(n)*100, 2), '%)')
                 ) %>% select(-n)
  df_freq_02 <- df_02 %>% count(.data[[col_01]]) %>% mutate(
                !!group_02 := paste0(comma(n, digits = 0), '(', round(n/sum(n)*100, 2), '%)')
                 ) %>% select(-n)
  df_freq_03 <- df_freq_01 %>% left_join(df_freq_02, by=col_01) %>% 
                rename(요인 = all_of(col_01)) %>% mutate(변수명 = col_01) %>% 
                select(변수명, 요인, all_of(c(group_01, group_02)))
  df_chidq_01 <- df_03 %>% select(all_of(c(col_01, col_02))) %>% table() %>%
                 # pearson 카이제곱 적용
                 chisq.test(correct = FALSE) 
  df_chidq02 <- df_chidq_01 %>% tidy() %>% select(`X-squared`='statistic', `p-value` = `p.value`) %>%
                 mutate(
                   `X-squared` = sprintf('%.2f', `X-squared`),
                   `p-value` = case_when(
                   `p-value` >= 0.05 ~ '> 0.05',
                   `p-value` >= 0.01 ~ '< 0.05',
                   TRUE ~ '< 0.01'
                   ))
  df_fit_01 <- bind_cols(df_freq_03, df_chidq02)
  
  return(df_fit_01)
}

col_list_01 <- c(
  '성별', '연령구분', '교육수준', '결혼여부', '거주지역',
  '경제활동상태', '중위가구소득', '흡연자', '고위험음주여부',
  '유산소실천여부', '스트레스인지', '범불안장애위험', '비만여부',
  '고혈압의사진단여부', '이상지질혈증의사진단여부'
)

# 각 변수별 교차분석 진행
result_chisq_01 <- data.frame(
  map_dfr(col_list_01, function(x){
    summary_freq(x, '당뇨병의사진단여부', 
                 '당뇨경험집단', '일반집단',
                 df_diabetes_001, df_non_diabetes_001, df_001)
  }), check.names = FALSE)
#print(result_chisq_01)

# model1에 따른 변수별 교차분석 진행
# (model1: 주관적 체형인식: 비만(응답 4,5)/비비만(응답 1,2,3))

# 당뇨경험집단
df_diabetes_md1_fat <- df_diabetes_001 %>% filter(model1 == '비만')
df_diabetes_md1_not <- df_diabetes_001 %>% filter(model1 == '비비만')

result_chisq_02 <- data.frame(
  map_dfr(col_list_01, function(x){
    summary_freq(x, 'model1', 
                 '체형인식_비만', '체형인식_비비만',
                 df_diabetes_md1_fat, df_diabetes_md1_not, df_diabetes_001)
  }), check.names = FALSE)
#print(result_chisq_02)

# 일반집단
df_non_diabetes_md1_fat <- df_non_diabetes_001 %>% filter(model1 == '비만')
df_non_diabetes_md1_not <- df_non_diabetes_001 %>% filter(model1 == '비비만')

result_chisq_03 <- data.frame(
    map_dfr(col_list_01, function(x){
    summary_freq(x, 'model1',
                 '체형인식_비만', '체형인식_비비만',
                 df_non_diabetes_md1_fat, df_non_diabetes_md1_not, df_non_diabetes_001
                 )
    }), check.names = FALSE)
#print(result_chisq_03)

# model2에 따른 변수별 교차분석 진행
# (model2: 주관적 체형인식: 보통이상(응답 3,4,5)/마른편(응답 1,2,3))

# 당뇨경험집단
df_diabetes_md2_norm <- df_diabetes_001 %>% filter(model2 == '보통이상')
df_diabetes_md2_thin <- df_diabetes_001 %>% filter(model2 == '마른편')

result_chisq_04 <- data.frame(
  map_dfr(col_list_01, function(x){
  summary_freq(x, 'model2',
               '체형인식_보통이상', '체형인식_마른편',
               df_diabetes_md2_norm, df_diabetes_md2_thin, df_diabetes_001
               )
  }), check.names = FALSE)
print(result_chisq_04)
#                     변수명     요인 체형인식_보통이상 체형인식_마른편 X-squared p-value
#1                      성별     남자       395(54.48%)      60(74.07%)     11.38  < 0.01
#2                      성별     여자       330(45.52%)      21(25.93%)     11.38  < 0.01
#3                  연령구분   45이하        96(13.24%)        2(2.47%)      7.92  < 0.01
#4                  연령구분   46이상       629(86.76%)      79(97.53%)      7.92  < 0.01
#5                  교육수준 고졸이하       465(64.14%)      53(65.43%)      0.05  > 0.05
#6                  교육수준 대졸이상       260(35.86%)      28(34.57%)      0.05  > 0.05
#7                  결혼여부     기혼       655(90.34%)       78(96.3%)      3.13  > 0.05
#8                  결혼여부     미혼         70(9.66%)         3(3.7%)      3.13  > 0.05
#9                  거주지역       동        559(77.1%)      57(70.37%)      1.83  > 0.05
#10                 거주지역   읍·면        166(22.9%)      24(29.63%)      1.83  > 0.05
#11             경제활동상태   아니요       222(30.62%)      28(34.57%)      0.53  > 0.05
#12             경제활동상태       예       503(69.38%)      53(65.43%)      0.53  > 0.05
#13             중위가구소득     미만       402(55.45%)      46(56.79%)      0.05  > 0.05
#14             중위가구소득     이상       323(44.55%)      35(43.21%)      0.05  > 0.05
#15                   흡연자 비흡연자       532(73.38%)      51(62.96%)      3.95  < 0.05
#16                   흡연자   흡연자       193(26.62%)      30(37.04%)      3.95  < 0.05
#17           고위험음주여부 고위험군       109(15.03%)      14(17.28%)      0.29  > 0.05
#18           고위험음주여부   정상군       616(84.97%)      67(82.72%)      0.29  > 0.05
#19           유산소실천여부   비실천       438(60.41%)      49(60.49%)      0.00  > 0.05
#20           유산소실천여부     실천       287(39.59%)      32(39.51%)      0.00  > 0.05
#21             스트레스인지 많이인지       221(30.48%)       23(28.4%)      0.15  > 0.05
#22             스트레스인지 적게인지       504(69.52%)       58(71.6%)      0.15  > 0.05
#23           범불안장애위험     양호       611(84.28%)      70(86.42%)      0.26  > 0.05
#24           범불안장애위험     위험       114(15.72%)      11(13.58%)      0.26  > 0.05
#25                 비만여부     비만       450(62.07%)        2(2.47%)    105.08  < 0.01
#26                 비만여부   비만전       275(37.93%)      79(97.53%)    105.08  < 0.01
#27       고혈압의사진단여부     없음       324(44.69%)      54(66.67%)     14.13  < 0.01
#28       고혈압의사진단여부     있음       401(55.31%)      27(33.33%)     14.13  < 0.01
#29 이상지질혈증의사진단여부     없음       241(33.24%)      37(45.68%)      4.99  < 0.05
#30 이상지질혈증의사진단여부     있음       484(66.76%)      44(54.32%)      4.99  < 0.05

# 일반집단
df_non_diabetes_md2_norm <- df_non_diabetes_001 %>% filter(model2 == '보통이상')
df_non_diabetes_md2_thin <- df_non_diabetes_001 %>% filter(model2 == '마른편')

result_chisq_05 <- data.frame(
  map_dfr(col_list_01, function(x){
  summary_freq(x, 'model2',
               '체형인식_보통이상', '체형인식_마른편',
               df_non_diabetes_md2_norm, df_non_diabetes_md2_thin, df_non_diabetes_001
              )
  }), check.names = FALSE)
print(result_chisq_05)
#                     변수명     요인 체형인식_보통이상 체형인식_마른편 X-squared p-value
#1                      성별     남자     3,557(40.51%)     589(49.21%)     32.82  < 0.01
#2                      성별     여자     5,224(59.49%)     608(50.79%)     32.82  < 0.01
#3                  연령구분   45이하     4,418(50.31%)     671(56.06%)     13.91  < 0.01
#4                  연령구분   46이상     4,363(49.69%)     526(43.94%)     13.91  < 0.01
#5                  교육수준 고졸이하     3,982(45.35%)     556(46.45%)      0.52  > 0.05
#6                  교육수준 대졸이상     4,799(54.65%)     641(53.55%)      0.52  > 0.05
#7                  결혼여부     기혼     6,395(72.83%)     706(58.98%)     98.43  < 0.01
#8                  결혼여부     미혼     2,386(27.17%)     491(41.02%)     98.43  < 0.01
#9                  거주지역       동     7,444(84.77%)   1,043(87.13%)      4.62  < 0.05
#10                 거주지역   읍·면     1,337(15.23%)     154(12.87%)      4.62  < 0.05
#11             경제활동상태   아니요     2,403(27.37%)     378(31.58%)      9.30  < 0.01
#12             경제활동상태       예     6,378(72.63%)     819(68.42%)      9.30  < 0.01
#13             중위가구소득     미만     4,299(48.96%)     621(51.88%)      3.60  > 0.05
#14             중위가구소득     이상     4,482(51.04%)     576(48.12%)      3.60  > 0.05
#15                   흡연자 비흡연자     7,177(81.73%)     902(75.36%)     27.81  < 0.01
#16                   흡연자   흡연자     1,604(18.27%)     295(24.64%)     27.81  < 0.01
#17           고위험음주여부 고위험군     1,187(13.52%)     160(13.37%)      0.02  > 0.05
#18           고위험음주여부   정상군     7,594(86.48%)   1,037(86.63%)      0.02  > 0.05
#19           유산소실천여부   비실천     4,198(47.81%)      577(48.2%)      0.07  > 0.05
#20           유산소실천여부     실천     4,583(52.19%)      620(51.8%)      0.07  > 0.05
#21             스트레스인지 많이인지     2,478(28.22%)     350(29.24%)      0.54  > 0.05
#22             스트레스인지 적게인지     6,303(71.78%)     847(70.76%)      0.54  > 0.05
#23           범불안장애위험     양호     7,509(85.51%)   1,022(85.38%)      0.02  > 0.05
#24           범불안장애위험     위험     1,272(14.49%)     175(14.62%)      0.02  > 0.05
#25                 비만여부     비만      3,442(39.2%)         6(0.5%)    697.52  < 0.01
#26                 비만여부   비만전      5,339(60.8%)    1,191(99.5%)    697.52  < 0.01
#27       고혈압의사진단여부     없음     7,553(86.02%)   1,132(94.57%)     68.34  < 0.01
#28       고혈압의사진단여부     있음     1,228(13.98%)       65(5.43%)     68.34  < 0.01
#29 이상지질혈증의사진단여부     없음     7,389(84.15%)   1,091(91.14%)     40.42  < 0.01
#30 이상지질혈증의사진단여부     있음     1,392(15.85%)      106(8.86%)     40.42  < 0.01