rm(list=ls())
library(fs)
library(vroom)
library(broom)# tidy()
library(stringr)
library(tidyverse)
library(formattable)

# 분석용 csv파일 불러오기
path_001 <- 'D:/github'
df_list_001 <- dir_ls(path = path_001, regexp = 'analyze_target.*\\.csv$')

df_001 <- vroom(df_list_001)

# '당뇨병의사진단여부'에 따른 분석집단 구분
# '당뇨병의사진단여부'에 따른 응답 빈도 비교
#df_001 %>% count(당뇨병의사진단여부)

# df_diabetes_001: 당뇨병의사진단여부="있음" 응답자
df_diabetes_001 <- 
  df_001 %>% filter(당뇨병의사진단여부=="있음") %>%
# '당뇨병의사진단여부' 열 제거
  select(-당뇨병의사진단여부)
#nrow(df_diabetes_001)

# df_non_diabetes_001: 당뇨병의사진단여부="없음" 응답자
df_non_diabetes_001 <- df_001 %>% filter(당뇨병의사진단여부=="없음") %>%
# '당뇨병의사진단여부' 열 제거
  select(-당뇨병의사진단여부)
#nrow(df_non_diabetes_001)

# 변수 및 요인별 빈도수 정리 함수 생성
summary_freq <- function(col_01, col_02, 
                         group_01, group_02,
                         df_01, df_02, df_03){
  df_freq_01 <- df_01 %>% count(.data[[col_01]]) %>% mutate(
                !!group_01 := paste0(comma(n, digits = 0), '(', round(n/sum(n)*100, 2), '%)')
                 ) %>% select(-n)
  df_freq_02 <- df_02 %>% count(.data[[col_01]]) %>% mutate(
                !!group_02 := paste0(comma(n, digits = 0), '(', round(n/sum(n)*100, 2), '%)')
                 ) %>% select(-n)
  df_freq_03 <- df_freq_01 %>% left_join(df_freq_02, by=col_01) %>% 
                rename(요인 = all_of(col_01)) %>% mutate(변수명 = col_01) %>% 
                select(변수명, 요인, all_of(c(group_01, group_02)))
  df_chidq_01 <- df_03 %>% select(all_of(c(col_01, col_02))) %>% table() %>%
                 # pearson 카이제곱 적용
                 chisq.test(correct = FALSE) 
  df_chidq02 <- df_chidq_01 %>% tidy() %>% select(`X-squared`='statistic', `p-value` = `p.value`) %>%
                 mutate(
                   `X-squared` = sprintf('%.2f', `X-squared`),
                   `p-value` = case_when(
                   `p-value` >= 0.05 ~ '> 0.05',
                   `p-value` >= 0.01 ~ '< 0.05',
                   TRUE ~ '< 0.01'
                   ))
  df_fit_01 <- bind_cols(df_freq_03, df_chidq02)
  
  return(df_fit_01)
}

col_list_01 <- c(
  '성별', '연령구분', '교육수준', '결혼여부', '거주지역',
  '경제활동상태', '중위가구소득', '흡연자', '고위험음주여부',
  '유산소실천여부', '스트레스인지', '범불안장애위험', '비만여부',
  '고혈압의사진단여부', '이상지질혈증의사진단여부'
)

# 각 변수별 교차분석 진행
result_chisq_01 <- data.frame(
  map_dfr(col_list_01, function(x){
    summary_freq(x, '당뇨병의사진단여부', 
                 '당뇨경험집단', '일반집단',
                 df_diabetes_001, df_non_diabetes_001, df_001)
  }), check.names = FALSE)
#print(result_chisq_01)

# model1에 따른 변수별 교차분석 진행
# (model1: 주관적 체형인식: 비만(응답 4,5)/비비만(응답 1,2,3))

# 당뇨경험집단
df_diabetes_md1_fat <- df_diabetes_001 %>% filter(model1 == '비만')
df_diabetes_md1_not <- df_diabetes_001 %>% filter(model1 == '비비만')

result_chisq_02 <- data.frame(
  map_dfr(col_list_01, function(x){
    summary_freq(x, 'model1', 
                 '체형인식_비만', '체형인식_비비만',
                 df_diabetes_md1_fat, df_diabetes_md1_not, df_diabetes_001)
  }), check.names = FALSE)
print(result_chisq_02)
#                     변수명     요인 체형인식_비만 체형인식_비비만 X-squared p-value
#1                      성별     남자   268(52.45%)     187(63.39%)      9.11  < 0.01
#2                      성별     여자   243(47.55%)     108(36.61%)      9.11  < 0.01
#3                  연령구분   45이하    84(16.44%)       14(4.75%)     23.94  < 0.01
#4                  연령구분   46이상   427(83.56%)     281(95.25%)     23.94  < 0.01
#5                  교육수준 고졸이하   323(63.21%)      195(66.1%)      0.68  > 0.05
#6                  교육수준 대졸이상   188(36.79%)      100(33.9%)      0.68  > 0.05
#7                  결혼여부     기혼   450(88.06%)     283(95.93%)     14.06  < 0.01
#8                  결혼여부     미혼    61(11.94%)       12(4.07%)     14.06  < 0.01
#9                  거주지역       동   400(78.28%)     216(73.22%)      2.66  > 0.05
#10                 거주지역   읍·면   111(21.72%)      79(26.78%)      2.66  > 0.05
#11             경제활동상태   아니요   160(31.31%)      90(30.51%)      0.06  > 0.05
#12             경제활동상태       예   351(68.69%)     205(69.49%)      0.06  > 0.05
#13             중위가구소득     미만   280(54.79%)     168(56.95%)      0.35  > 0.05
#14             중위가구소득     이상   231(45.21%)     127(43.05%)      0.35  > 0.05
#15                   흡연자 비흡연자   373(72.99%)     210(71.19%)      0.31  > 0.05
#16                   흡연자   흡연자   138(27.01%)      85(28.81%)      0.31  > 0.05
#17           고위험음주여부 고위험군    82(16.05%)       41(13.9%)      0.67  > 0.05
#18           고위험음주여부   정상군   429(83.95%)      254(86.1%)      0.67  > 0.05
#19           유산소실천여부   비실천   315(61.64%)     172(58.31%)      0.87  > 0.05
#20           유산소실천여부     실천   196(38.36%)     123(41.69%)      0.87  > 0.05
#21             스트레스인지 많이인지   171(33.46%)      73(24.75%)      6.73  < 0.01
#22             스트레스인지 적게인지   340(66.54%)     222(75.25%)      6.73  < 0.01
#23           범불안장애위험     양호   422(82.58%)      259(87.8%)      3.88  < 0.05
#24           범불안장애위험     위험    89(17.42%)       36(12.2%)      3.88  < 0.05
#25                 비만여부     비만   403(78.86%)      49(16.61%)    294.29  < 0.01
#26                 비만여부   비만전   108(21.14%)     246(83.39%)    294.29  < 0.01
#27       고혈압의사진단여부     없음   214(41.88%)     164(55.59%)     14.13  < 0.01
#28       고혈압의사진단여부     있음   297(58.12%)     131(44.41%)     14.13  < 0.01
#29 이상지질혈증의사진단여부     없음   159(31.12%)     119(40.34%)      7.04  < 0.01
#30 이상지질혈증의사진단여부     있음   352(68.88%)     176(59.66%)      7.04  < 0.01

# 일반집단
df_non_diabetes_md1_fat <- df_non_diabetes_001 %>% filter(model1 == '비만')
df_non_diabetes_md1_not <- df_non_diabetes_001 %>% filter(model1 == '비비만')

result_chisq_03 <- data.frame(
    map_dfr(col_list_01, function(x){
    summary_freq(x, 'model1',
                 '체형인식_비만', '체형인식_비비만',
                 df_non_diabetes_md1_fat, df_non_diabetes_md1_not, df_non_diabetes_001
                 )
    }), check.names = FALSE)
#                     변수명     요인 체형인식_비만 체형인식_비비만 X-squared p-value
#1                      성별     남자 2,055(41.72%)   2,091(41.39%)      0.11  > 0.05
#2                      성별     여자 2,871(58.28%)   2,961(58.61%)      0.11  > 0.05
#3                  연령구분   45이하 2,506(50.87%)   2,583(51.13%)      0.07  > 0.05
#4                  연령구분   46이상 2,420(49.13%)   2,469(48.87%)      0.07  > 0.05
#5                  교육수준 고졸이하 2,252(45.72%)   2,286(45.25%)      0.22  > 0.05
#6                  교육수준 대졸이상 2,674(54.28%)   2,766(54.75%)      0.22  > 0.05
#7                  결혼여부     기혼 3,644(73.97%)   3,457(68.43%)     37.39  < 0.01
#8                  결혼여부     미혼 1,282(26.03%)   1,595(31.57%)     37.39  < 0.01
#9                  거주지역       동 4,130(83.84%)   4,357(86.24%)     11.32  < 0.01
#10                 거주지역   읍·면   796(16.16%)     695(13.76%)     11.32  < 0.01
#11             경제활동상태   아니요 1,326(26.92%)    1,455(28.8%)      4.39  < 0.05
#12             경제활동상태       예 3,600(73.08%)    3,597(71.2%)      4.39  < 0.05
#13             중위가구소득     미만 2,454(49.82%)   2,466(48.81%)      1.01  > 0.05
#14             중위가구소득     이상 2,472(50.18%)   2,586(51.19%)      1.01  > 0.05
#15                   흡연자 비흡연자 4,020(81.61%)   4,059(80.34%)      2.58  > 0.05
#16                   흡연자   흡연자   906(18.39%)     993(19.66%)      2.58  > 0.05
#17           고위험음주여부 고위험군   737(14.96%)     610(12.07%)     17.80  < 0.01
#18           고위험음주여부   정상군 4,189(85.04%)   4,442(87.93%)     17.80  < 0.01
#19           유산소실천여부   비실천 2,423(49.19%)   2,352(46.56%)      6.92  < 0.01
#20           유산소실천여부     실천 2,503(50.81%)   2,700(53.44%)      6.92  < 0.01
#21             스트레스인지 많이인지  1,542(31.3%)   1,286(25.46%)     42.00  < 0.01
#22             스트레스인지 적게인지  3,384(68.7%)   3,766(74.54%)     42.00  < 0.01
#23           범불안장애위험     양호 4,162(84.49%)   4,369(86.48%)      7.97  < 0.01
#24           범불안장애위험     위험   764(15.51%)     683(13.52%)      7.97  < 0.01
#25                 비만여부     비만 3,137(63.68%)      311(6.16%)   3649.70  < 0.01
#26                 비만여부   비만전 1,789(36.32%)   4,741(93.84%)   3649.70  < 0.01
#27       고혈압의사진단여부     없음  4,064(82.5%)   4,621(91.47%)    177.83  < 0.01
#28       고혈압의사진단여부     있음    862(17.5%)      431(8.53%)    177.83  < 0.01
#29 이상지질혈증의사진단여부     없음 4,014(81.49%)    4,466(88.4%)     93.46  < 0.01
#30 이상지질혈증의사진단여부     있음   912(18.51%)      586(11.6%)     93.46  < 0.01