rm(list=ls())
library(fs)
library(vroom)
library(tidyverse)
library(formattable)

# 분석용 csv파일 불러오기
path_001 <- 'D:/github'
df_list_001 <- dir_ls(path = path_001, regexp = 'analyze_target.*\\.csv$')

df_001 <- vroom(df_list_001)

# '당뇨병의사진단여부'에 따른 분석집단 구분
# '당뇨병의사진단여부'에 따른 응답 빈도 비교
#df_001 %>% count(당뇨병의사진단여부)

# df_diabetes_001: 당뇨병의사진단여부="있음" 응답자
df_diabetes_001 <- 
  df_001 %>% filter(당뇨병의사진단여부=="있음") %>%
# '당뇨병의사진단여부' 열 제거
  select(-당뇨병의사진단여부)
#nrow(df_diabetes_001)

# df_non_diabetes_001: 당뇨병의사진단여부="없음" 응답자
df_non_diabetes_001 <- df_001 %>% filter(당뇨병의사진단여부=="없음") %>%
# '당뇨병의사진단여부' 열 제거
  select(-당뇨병의사진단여부)
#nrow(df_non_diabetes_001)

# 변수 및 요인별 빈도수 정리 함수 생성
summary_freq <- function(col_01){
  df_01 <- df_diabetes_001 %>% count(.data[[col_01]]) %>% mutate(
    당뇨경험집단 = paste0(comma(n, digits = 0), '(', round(n/sum(n)*100, 2), '%)')
  ) %>% select(-n)
  df_02 <- df_non_diabetes_001 %>% count(.data[[col_01]]) %>% mutate(
    일반집단 = paste0(comma(n, digits = 0), '(', round(n/sum(n)*100, 2), '%)')
  ) %>% select(-n)
  df_03 <- df_01 %>% left_join(df_02, by=col_01) %>% rename(요인 = col_01) %>% 
           mutate(변수명 = col_01) %>% select(변수명, 요인, 당뇨경험집단, 일반집단)
  return(df_03)
}

# 각 변수별 빈도수 출력 정리
result_01 <- data.frame(rbind(
  summary_freq('성별'),
  summary_freq('연령구분'),
  summary_freq('교육수준'),
  summary_freq('결혼여부'),
  summary_freq('거주지역'),
  summary_freq('경제활동상태'),
  summary_freq('중위가구소득'),
  summary_freq('흡연자'),
  summary_freq('고위험음주여부'),
  summary_freq('스트레스인지'),
  summary_freq('범불안장애위험'),
  summary_freq('비만여부'),
  summary_freq('고혈압의사진단여부'),
  summary_freq('이상지질혈증의사진단여부')
))
print(result_01)
# 출력 결과
#                     변수명     요인 당뇨경험집단      일반집단
#1                      성별     남자  455(56.45%) 4,147(41.55%)
#2                      성별     여자  351(43.55%) 5,833(58.45%)
#3                  연령구분   45이하   98(12.16%)    5,090(51%)
#4                  연령구분   46이상  708(87.84%)    4,890(49%)
#5                  교육수준 고졸이하  518(64.27%) 4,540(45.49%)
#6                  교육수준 대졸이상  288(35.73%) 5,440(54.51%)
#7                  결혼여부     기혼  733(90.94%) 7,102(71.16%)
#8                  결혼여부     미혼    73(9.06%) 2,878(28.84%)
#9                  거주지역       동  616(76.43%) 8,489(85.06%)
#10                 거주지역   읍·면  190(23.57%) 1,491(14.94%)
#11             경제활동상태   아니요  250(31.02%) 2,783(27.89%)
#12             경제활동상태       예  556(68.98%) 7,197(72.11%)
#13             중위가구소득     미만  448(55.58%) 4,922(49.32%)
#14             중위가구소득     이상  358(44.42%) 5,058(50.68%)
#15                   흡연자 비흡연자  583(72.33%) 8,081(80.97%)
#16                   흡연자   흡연자  223(27.67%) 1,899(19.03%)
#17           고위험음주여부 고위험군  123(15.26%)  1,347(13.5%)
#18           고위험음주여부   정상군  683(84.74%)  8,633(86.5%)
#19             스트레스인지 많이인지  244(30.27%) 2,828(28.34%)
#20             스트레스인지 적게인지  562(69.73%) 7,152(71.66%)
#21           범불안장애위험     양호  681(84.49%)  8,533(85.5%)
#22           범불안장애위험     위험  125(15.51%)  1,447(14.5%)
#23                 비만여부     비만  452(56.08%) 3,449(34.56%)
#24                 비만여부   비만전  354(43.92%) 6,531(65.44%)
#25       고혈압의사진단여부     없음   378(46.9%) 8,687(87.04%)
#26       고혈압의사진단여부     있음   428(53.1%) 1,293(12.96%)
#27 이상지질혈증의사진단여부     없음  278(34.49%) 8,481(84.98%)
#28 이상지질혈증의사진단여부     있음  528(65.51%) 1,499(15.02%)